{"Acessando-o-Guacamole":{"slug":"Acessando-o-Guacamole","filePath":"Acessando o Guacamole.md","title":"Acessando o Guacamole","links":["Guacamole"],"tags":[],"content":"Acesse o Guacamole e pesquise pelo domínio do cliente, após achar acesse o servidor e rode os comandos abaixo:\ncd web\ncd dominiodocliente.com.br (você pode digitar cd e apertar tab tab, que ele irá completar)\ncd public_html\nls (se tiver apenas os arquivos index.html e robots.txt rode o comando abaixo) \nrm * -r\n\nApós realizar esse procedimento é necessário gerar a chave SSH para conseguir realizar o Git clone então será necessário rodar os comandos abaixo:\nssh-keygen -t rsa -b 4096 -C &quot;contato@buscacliente.com.br&quot; \n(após o comando acima aperte Enter três vezes e sua chave será zerada)\ncat ~/.ssh/id_rsa.pub\n\nCopie a saída completa do comando cat e acesse novamente o bitbucket e siga o passo a passo abaixo:\n\n\nClique em Add Key, no nome você irá colocar o domínio do cliente e no campo Key adicione a saída do seu comando cat, clique em Add Key e pronto. Agora volte ao repositório e clique no botão Clone, troque de HTTPS para SSH copie o comando e no final do comando adicione public_html igual abaixo\ngit clone git@bitbucket.org:busca-clientes/dominiodocliente.com.br.git public_html\nyes (será solicitado que digite)\n\nE cole esse comando no servidor e espere ele finalizar, assim que finalizar pode digitar Exit e voltar para o menu principal."},"Apontamento-de-DNS-na-Cloudflare":{"slug":"Apontamento-de-DNS-na-Cloudflare","filePath":"Apontamento de DNS na Cloudflare.md","title":"Apontamento de DNS na Cloudflare","links":[],"tags":[],"content":"Acesse a CloudFlare entre na conta do Growth e clique em Integrar um domínio.\nRealize a configuração igual abaixo:\nClique em Continuar e selecione o plano free, desative o proxy.\n\nExclua qualquer registro que seja NS e AAAA.\nAntes de alterar o IP do domínio verifique se nenhum MX ou outra configuração de webmail esteja apontada para o domínio, caso esteja altere o apontamento de domínio para o IP do domínio (o antigo e não o que o nosso TI te enviou), após verificar e realizar as alterações para que tudo funcione, troque o registro A para o IP que o nosso TI enviou, e adicione um CNAME www @ (pois assim ele irá apontar para o domínio)\n\nAltere apenas o registro do domínio, caso tenha outro como por exemplo: ftp, não altere o IP dele.\n\nClique em continuar para a Ativação.\nAgora vá até o registro.br e altere os DNS que estão lá por esses que apareceram na tela após avançar da etapa anterior.\nApós alterar, envie o e-mail para o TI realizar a “Ativação de SSL” aguarde o TI enviar que conseguiu realizar a ativação do SSL e verifique a propagação do DNS (se ele já está com o IP que você colocou ou não). Para realizar a verificação acesse o dnschecker.org"},"BitBucket":{"slug":"BitBucket","filePath":"BitBucket.md","title":"BitBucket","links":[],"tags":[],"content":"O Bitbucket é uma plataforma de hospedagem de código-fonte usada principalmente para controle de versão de projetos de software. Ele permite que desenvolvedores e equipes armazenem, gerenciem, compartilhem e colaborem em códigos de forma segura e organizada.\nO Bitbucket serve para:\n\nArmazenar o código-fonte de projetos na nuvem\nControlar versões do código (histórico de alterações)\nFacilitar o trabalho colaborativo entre desenvolvedores\nRevisar código antes de integrá-lo ao projeto principal\nAutomatizar testes, builds e deploys\nIntegrar o desenvolvimento com ferramentas de gestão de tarefas\n\nÉ necessário que tenha o acesso ao BitBucket para poder realizar as mudanças no código alterando o valor de algumas variáveis para o pleno funcionamento do código."},"Colocando-o-sitemap.xml":{"slug":"Colocando-o-sitemap.xml","filePath":"Colocando o sitemap.xml.md","title":"Colocando o sitemap.xml","links":[],"tags":[],"content":"Acesse novamente o Search console e procure pelo domínio que você cadastrou, após achar clique nele e clique em “Ir para a propriedade” na janela que aparecer.\nVá até o menu na esquerda e procure por Sitemaps, no campo para digitar coloque sitemap.xml na primeira vez ele irá dar erro isso é normal, coloque novamente e pronto ele irá aparecer como Processado, agora acesse o site do cliente e verifique se está tudo normal."},"Contas-Google-do-Busca-Cliente":{"slug":"Contas-Google-do-Busca-Cliente","filePath":"Contas Google do Busca Cliente.md","title":"Contas Google do Busca Cliente","links":[],"tags":[],"content":"As contas do Google são necessárias para que a gente consiga a partir delas fazer os procedimentos necessários na Google e inserir no código.\nEntão é necessário que você tenha acesso as contas:\nbcrelatorios@gmail.com\nbcrelatorios2@gmail.com\nbcrelatoriotags@gmail.com\nbcrelatorios5@gmail.com"},"Criando-o-PR-no-BitBucket":{"slug":"Criando-o-PR-no-BitBucket","filePath":"Criando o PR no BitBucket.md","title":"Criando o PR no BitBucket","links":["BitBucket"],"tags":[],"content":"É necessário que envie um e-mail para o suporte@m3solutions.com.br solicitando a criação do Vhost e autorização para os usuários do Suporte/Deploy, solicite o modelo de e-mail para o Everton ou para o Hiago.\nAgora iremos utilizar o BitBucket para realizar o PR (Pull Request) e alterações necessárias no código. Na barra de pesquisa cole o domínio do cliente assim que aparecer selecione o repositório.\nAo acessar o repositório, clique em Pull Requests e caso tenha algum PR apenas dê o merge, se não tiver clique em criar Pull Request, ao clicar irá se abrir uma janela\n\n\nEssa é a tela de quando é necessário criar o PR, você está migrando o que estava na branch produção (ambiente de desenvolvimento) para a branch main (ambiente principal do projeto) é necessário clicar na caixa para deletar a branch de desenvolvimento após o merge, após verificar se está tudo certo clique em Create pull request.\nApós criar o pull request é necessário que você realize o merge, então na tela que irá se abrir você vai estar dentro do PR criado (Ou do PR que já existia) clique nos três pontinhas (caso não apareça o botão azul Merge) clique em Merge e pronto, PR feita."},"Editando-o-código":{"slug":"Editando-o-código","filePath":"Editando o código.md","title":"Editando o código","links":["Painel-do-Busca-Cliente"],"tags":[],"content":"Após realizar o PR será necessário que altere o arquivo geral.php você pode escolher em alterar diretamente no BitBucket ou rodar o comando git clone https://{dominiodocliente.com.br} esse comando você consegue pegar no próprio repositório clicando em Clone mudando de HTTPS para SSH.\nComo editar o código via BitBucket\nClique em “Source” e na barra de pesquisa menor digite “geral.php” clique no arquivo e clique em Edit. A tela irá recarregar desça até achar “Config Final Deploy”, você irá alterar apenas as variáveis:\n\n\n                  \n                  NOTE\n                  \n                \n\n$idProjetoBusca: Número do painel do cliente se não estiver no comentário do salesforce será necessário procurar no Painel do Busca Cliente\n$tagmanager: Iremos gerar a tag mais pra frente\n$googleSearchConsole: Iremos gerar a tag mais pra frente\n$siteKey: Iremos gerar a tag mais pra frente\n$secretKey:  Iremos gerar a tag mais pra frente\n\n\nCriando as chaves do Recaptcha\nVamos começar pelas variáveis $siteKey e $secretKey são as variáveis do Recaptcha abra o navegador que está logado a conta bcrelatorios após fazer o login acesse www.google.com/recaptcha/admin/create\nInsira as informações conforme abaixo: \nApós inserir as informações não é necessário nenhuma outra alteração, clique em “Enviar” a tela será recarregada com as duas chaves exatamente na ordem, o primeiro campo com o nome de chave de site será para a variável $siteKey e a chave secreta será para a variável $secretKey\nPronto, após colar essas informações no código vamos para o próximo passo.\nCriando a chave do Google Analytics\nAcesse o Google Analytics ainda na conta bcrelatorios (caso ainda funcione para criar propriedades consulte o Everton ou responsável na área de Deploy)\nNo canto inferior esquerdo clique na engrenagem escrito “Administrador” após acessar essa aba clique em Criar e logo após clique em “Propriedade”.\nApós a tela carregar insira as informações igual abaixo:\nNa tela abaixo selecione a plataforma “Web” irá abrir uma tela e você insere o domínio nos dois\ncampos e clique em avançar:\n\n\nClique em Criar e Continuar, a primeira tela que abrir você pode fechar e espere a segunda tela com o nome de “Detalhes do stream Web” abrir, assim que abrir significa que o Google Analytics está feito, Salve o ID da Métrica vamos usar no Tag Mannager.\nCriando as chaves do Tag Mannager\nAo abrir o Tag Mannager (tagmanager.google.com/#/container/accounts/6254899739/containers/240786148/workspaces/3) Esteja logado na conta bcrelatoriotag@gmail.com\nAcesse qualquer domínio, clique em Administrador e no botão de + para criar um novo contêiner \n\nApós criar volte na tela de Administrador e clique em Importar contêiner, utilize o arquivo 0 1 2.json caso não possua o arquivo solicite para o Everton ou para o responsável pela área de Deploy. Desça e clique em “Adicionar o espaço de Trabalho”.\nApós adicionar clique em “Variáveis” no menu esquerdo.\nSelecione a única variável disponível e altere o “Título” e o valor no campo “Configuração de Variável” pelo ID da métrica que foi gerado no Google Analytics. Após realizar a troca clique em “Salvar” e após a tela fechar Não esqueça de clicar em ENVIAR se não nada que foi feito estará salvo no domínio.\nClicou em “Enviar”, na tela que aparecer clique em “Publicar”, na próxima tela que abrir clique em “Pular” e pronto, o Tag Mannager está feito.\nAgora volte na aba “Espaços de Trabalho” e copie o número selecionado abaixo e coloca ele na variável $tagmanager\n\nVamos para o Google Search.\nCriando a Propriedade no Search Console\nAcesse o site do google search console com a conta bcrelatorios5, após acessar clique no botão que está mostrando um domínio e clique em adicionar propriedade:\n\nMude para Prefixo URL e insira os dados igual abaixo:\n\nSelecione Tag HTML, copie a tag () cole ela dentro de um bloco de notas ou outra aba do Google Chrome e copie apenas o hash dentro do content=“hash”:\n\nApós realizar isso insira a hash dentro da variável $googleSearchConsole e realize o commit. Caso esteja fazendo dentro do vscode será necessário rodar os comandos abaixo:\ngit add .\ngit commit -m &quot;Config Deploy&quot;\ngit push origin main\n\nE pronto o código irá atualizar no repositório.\nAlterando o Client.inc.php\nApós o e-mail do TI chegar com nome, usuário e senha você irá inserir:\n\n\n                  \n                  NOTE\n                  \n                \n\n‘USER’ = o nome que tiver menos caracteres vai nessa variável\n‘PASS’ = a senha enviada vai aqui\n‘DBSA’ = o nome que tiver mais caracteres vai nessa variável\n\n\nApós isso realize o commit da mesma forma que fez com o arquivo geral.php"},"Exportando-e-Importando-o-Banco-de-dados":{"slug":"Exportando-e-Importando-o-Banco-de-dados","filePath":"Exportando e Importando o Banco de dados.md","title":"Exportando e Importando o Banco de dados","links":[],"tags":[],"content":"Após verificar a propagação do DNS acesse: dominiodocliente.com.br/phpmyadmin ao acessar a tela insira os dados que foram colocados nas variáveis ‘USER’ e ‘PASS’ que estão no código.\nAcesse também deploy.buscaclientes.com.br e insira as informações que está um pouco mais acima das anteriores no código, elas está abaixo da linha comentada escrito // DEPLOY.\nApós inserir irá receber alguns avisos, clique em ignorar tudo (todas as vezes que aparecer).\nDentro do deploy.buscaclientes clique no banco existente, ele vai estar abaixo de “Novo BD” após selecionar, clique em “EXPORTAR” igual abaixo:\nClique em ignorar tudo e Executar novamente para realizar o download do banco.\nApós realizar o Download do banco acesse dominiodocliente.com.br/phpmyadmin insira as credenciais para fazer o acesso e repita o processo porém dessa vez não clique em “EXPORTAR” mas clique em IMPORTAR\n\n\n                  \n                  IMPORTANTE\n                  \n                \n\nSelecione o banco do cliente que estará abaixo do botão Novo\n\n\nSelecione o arquivo do banco, desça tudo e clique em Importar e pronto banco de dados importado."},"Finalizando-o-deploy":{"slug":"Finalizando-o-deploy","filePath":"Finalizando o deploy.md","title":"Finalizando o deploy","links":[],"tags":[],"content":"Após realizar o sitemap e o site estar no ar e funcionando, vá até o salesforce, clique em realcionado a, clique na razão social do cliente e em chatter. Coloque um @ e marque a pessoa responsável, você pode verificar na primeira página da tarefa no final dela por quem foi criado.\nMarque a pessoa e coloquei “site concluído”. Após isso é necessário adicionar as informações na planilha de fluxo, pode seguir como os outros acima só será necessário verificar se o site é um “Busca One” ou “Busca One Híbrido”, verifique também todas as atividades a frente para marcar elas como finalizado.\nE assim está realizado o processo de Deploy de um site."},"Fluxo-de-Deploy":{"slug":"Fluxo-de-Deploy","filePath":"Fluxo de Deploy.md","title":"Fluxo de Deploy","links":["Guacamole","BitBucket","Painel-do-Busca-Cliente","Salesforce","Contas-Google-do-Busca-Cliente","Criando-o-PR-no-BitBucket","Editando-o-código","Acessando-o-Guacamole","Apontamento-de-DNS-na-Cloudflare","Exportando-e-Importando-o-Banco-de-dados","Colocando-o-sitemap.xml","Finalizando-o-deploy"],"tags":[],"content":"Garanta que possua todos os acessos antes de iniciar o processo de deploy, será necessário ter acesso as plataformas:\nGuacamole\nBitBucket\nPainel do Busca Cliente\nSalesforce\nContas Google do Busca Cliente\nApós conseguir todos os acessos necessários vamos começar pelo e-mail.\nCriando o PR no BitBucket\nEditando o código\nAcessando o Guacamole\nApontamento de DNS na Cloudflare\nExportando e Importando o Banco de dados\nColocando o sitemap.xml\nFinalizando o deploy"},"Guacamole":{"slug":"Guacamole","filePath":"Guacamole.md","title":"Guacamole","links":[],"tags":[],"content":"Ele é o nosso “site” onde conseguimos realizar acesso aos servidores que estão com os Vhosts que são criados para que a gente possa dar o Git clone na public.\nSó é possível realizar o deploy completo do site do cliente realizando as etapas necessárias no Guacamole."},"Painel-do-Busca-Cliente":{"slug":"Painel-do-Busca-Cliente","filePath":"Painel do Busca Cliente.md","title":"Painel do Busca Cliente","links":[],"tags":[],"content":"O Painel é necessário para quando no comentário da tarefa no Salesforce não possui o número de painel e você precisa colocar este número do painel no código.\nEntão é necessário que acesse o painel, clique em projetos e na barra de pesquisa insira o domínio do cliente, assim irá achar o ID do cliente para colocar no código."},"Salesforce":{"slug":"Salesforce","filePath":"Salesforce.md","title":"Salesforce","links":[],"tags":[],"content":"O Salesforce é o CRM onde visualizamos as tarefas geradas pelos outros setores para que seja realizada a publicação do site.\nNele temos as tarefas do Deploy onde conseguimos visualizar os comentários, e toda a interação sobre o domínio, podemos investigar em algumas abas para achar algumas coisas que não foram colocadas no campo de comentário ou título, como o domínio por exemplo."},"index":{"slug":"index","filePath":"index.md","title":"index","links":["Fluxo-de-Deploy"],"tags":[],"content":"Bem-vindo à Wiki 📚\nAqui você encontra todas as documentações do projeto. Clique no que deseja ler:\n\nFluxo de Deploy para publicação de sites.\n"}}